Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 apply)
      + key                    = "builds/e15b4e68c7fc5ace451b72f50fafa2be62bfc87812b61a6baa9ecda2be9a4ce6.zip"
      + kms_key_id             = (known after apply)
      + region                 = "ap-southeast-3"
      + server_side_encryption = (known after apply)
      + source                 = "builds/e15b4e68c7fc5ace451b72f50fafa2be62bfc87812b61a6baa9ecda2be9a4ce6.zip"
      + storage_class          = "ONEZONE_IA"
      + tags_all               = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + version_id             = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e15b4e68c7fc5ace451b72f50fafa2be62bfc87812b61a6baa9ecda2be9a4ce6.zip"
              + quiet         = "true"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e15b4e68c7fc5ace451b72f50fafa2be62bfc87812b61a6baa9ecda2be9a4ce6.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/e15b4e68c7fc5ace451b72f50fafa2be62bfc87812b61a6baa9ecda2be9a4ce6.zip"
          + "timestamp" = "1765967652868966200"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.security.module.lambda-sendSecurityAlert.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/security-sendSecurityAlert"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "GXC"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "security-sendSecurityAlert"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.security.module.lambda-sendSecurityAlert.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "security-sendSecurityAlert-0"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ses:SendEmail"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ses:ap-southeast-3:209479276142:identity/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "security-sendSecurityAlert"
    }

  # module.security.module.lambda-sendSecurityAlert.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "security-sendSecurityAlert-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "security-sendSecurityAlert"
    }

  # module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Logs and alerts of any Inspector/CodeGuru findings"
      + filename                       = "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip"
      + function_name                  = "security-sendSecurityAlert"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "security-infrastructure"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "security-infrastructure"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 24
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "GASPI_ADMIN_EMAIL" = "devops@xapiens.id"
              + "SES_SOURCE_EMAIL"  = "no.reply.gaspi.notifications@gmail.com"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.security.module.lambda-sendSecurityAlert.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "security/lambda/sendSecurityAlert",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.plan.json"
      + id                   = (known after apply)
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip"
          + "timestamp" = "1765967651937789000"
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only the last 1 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "ap-southeast-3"
      + registry_id = (known after apply)
      + repository  = (known after apply)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "svep-pluginconsequence-lambda-containers"
      + region               = "ap-southeast-3"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only the last 1 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "ap-southeast-3"
      + registry_id = (known after apply)
      + repository  = (known after apply)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "svep-qcfigures-lambda-containers"
      + region               = "ap-southeast-3"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.svep[0].module.lambda-batchStarter.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-batchStarter.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-batchStarter"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-batchStarter.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-batchStarter"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-batchStarter.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-batchStarter-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-batchStarter"
    }

  # module.svep[0].module.lambda-batchStarter.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-batchStarter-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-batchStarter"
    }

  # module.svep[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Scheduler for sVEP batch submissions"
      + filename                       = "builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip"
      + function_name                  = "svep-backend-batchStarter"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-batchStarter.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/batchStarter",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-batchStarter.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip"
          + "timestamp" = "1765967651175498000"
        }
    }

  # module.svep[0].module.lambda-batchSubmit.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-batchSubmit.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-batchSubmit"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-batchSubmit.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-batchSubmit"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-batchSubmit.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-batchSubmit-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-batchSubmit"
    }

  # module.svep[0].module.lambda-batchSubmit.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-batchSubmit-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-batchSubmit"
    }

  # module.svep[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Batch submission of sVEP jobs"
      + filename                       = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip"
      + function_name                  = "svep-backend-batchSubmit"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-batchSubmit.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/batchSubmit",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip"
          + "timestamp" = "1765967651842005000"
        }
    }

  # module.svep[0].module.lambda-clearTempAndRegions.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-clearTempAndRegions.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-clearTempAndRegions"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-clearTempAndRegions.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-clearTempAndRegions"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-clearTempAndRegions.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-clearTempAndRegions-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-clearTempAndRegions"
    }

  # module.svep[0].module.lambda-clearTempAndRegions.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-clearTempAndRegions-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-clearTempAndRegions"
    }

  # module.svep[0].module.lambda-clearTempAndRegions.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Clears temp and regions buckets for finished sVEP executions"
      + filename                       = "builds/00f3a633231c795f8dc9de3856cbb31a0fa1dfb41fb36584d88a666c2997e65a.zip"
      + function_name                  = "svep-backend-clearTempAndRegions"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-clearTempAndRegions.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/clearTempAndRegions",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/00f3a633231c795f8dc9de3856cbb31a0fa1dfb41fb36584d88a666c2997e65a.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/00f3a633231c795f8dc9de3856cbb31a0fa1dfb41fb36584d88a666c2997e65a.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/00f3a633231c795f8dc9de3856cbb31a0fa1dfb41fb36584d88a666c2997e65a.zip"
          + "timestamp" = "1765967651373650000"
        }
    }

  # module.svep[0].module.lambda-concat.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-concat.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-concat"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-concat.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-concat"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-concat.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-concat-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-concat"
    }

  # module.svep[0].module.lambda-concat.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-concat-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-concat"
    }

  # module.svep[0].module.lambda-concat.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Triggers createPages."
      + filename                       = "builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.zip"
      + function_name                  = "svep-backend-concat"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-concat.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/concat",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-concat.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.zip"
          + "timestamp" = "1765967651532924800"
        }
    }

  # module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-concatPages.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-concatPages"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-concatPages.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-concatPages"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-concatPages.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-concatPages-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-concatPages"
    }

  # module.svep[0].module.lambda-concatPages.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-concatPages-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-concatPages"
    }

  # module.svep[0].module.lambda-concatPages.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "concatenates all the page files created by createPages lambda."
      + filename                       = "builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.zip"
      + function_name                  = "svep-backend-concatPages"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 3008
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-concatPages.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/concatPages",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-concatPages.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.zip"
          + "timestamp" = "1765967650649422800"
        }
    }

  # module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-concatStarter.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-concatStarter"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-concatStarter.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-concatStarter"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-concatStarter.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-concatStarter-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-concatStarter"
    }

  # module.svep[0].module.lambda-concatStarter.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-concatStarter-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-concatStarter"
    }

  # module.svep[0].module.lambda-concatStarter.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Validates all processing is done and triggers concat"
      + filename                       = "builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.zip"
      + function_name                  = "svep-backend-concatStarter"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-concatStarter.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/concatStarter",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-concatStarter.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.zip"
          + "timestamp" = "1765967651255756000"
        }
    }

  # module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-createPages.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/svep-backend-createPages"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-createPages.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-createPages"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-createPages.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-createPages-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-crea
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.